#  SQL DateTime Functions

In this exercise, we will use **DateTime functions** to aggregate and filter date and time data in order to extract relevant information.



##  Learning Objectives

By the end of this training, you should be able to:

-  Measure the period between dates and times.  
-  Extract portions of a DateTime column.  
-  Filter a DateTime column using logical and comparison operators.



##  Sample Database Setup

We’ll use the **Chinook** database for this exercise.  
It contains information about employees, customers, invoices, and tracks — which we’ll use to explore various DateTime operations.

In [1]:
%load_ext sql

In [4]:
%sql sqlite:///chinook.sqlite

##  View Tables in the Database

In [6]:
%%sql


SELECT name
FROM sqlite_master
WHERE type='table';

   sqlite:///chinook.db
 * sqlite:///chinook.sqlite
Done.

[('Album',),
 ('Artist',),
 ('Customer',),
 ('Employee',),
 ('Genre',),
 ('Invoice',),
 ('InvoiceLine',),
 ('MediaType',),
 ('Playlist',),
 ('PlaylistTrack',),
 ('Track',)]

##  Exercise 1 — View Data Types of the Employees Table

Run a query that will give us a view of the data type of the `employees` table.

In [7]:
%%sql
PRAGMA table_info(employees);

   sqlite:///chinook.db
 * sqlite:///chinook.sqlite
Done.

[]

##  Exercise 2 — Calculate Employees’ Age When Hired

Write a query that shows the **age of all employees when they were hired**.

Return data in the `FirstName` and `LastName` columns and create an **Age when hired** alias for the calculated age.

In [9]:
%%sql

SELECT 
    FirstName,
    LastName,
    (strftime('%Y', HireDate) - strftime('%Y', BirthDate)) AS "Age when hired"
FROM Employee;

   sqlite:///chinook.db
 * sqlite:///chinook.sqlite
Done.

[('Andrew', 'Adams', 40),
 ('Nancy', 'Edwards', 44),
 ('Jane', 'Peacock', 29),
 ('Margaret', 'Park', 56),
 ('Steve', 'Johnson', 38),
 ('Michael', 'Mitchell', 30),
 ('Robert', 'King', 34),
 ('Laura', 'Callahan', 36)]

##  Exercise 3 — Calculate Month-to-Month Revenue

In the context of DateTime SQL objects, the `substr()` function allows us to trim or extract certain parts of a date or time string.  
We use it by specifying the column and the indices, i.e., `substr(datetime_column, start_index, length)`.

Write a query that calculates the **month-to-month revenue** at Chinook.

Return the **month** and **revenue**, using aliases to name the calculated columns appropriately.

In [11]:
%%sql

SELECT 
    substr(InvoiceDate, 1, 7) AS Month,   -- Extracts YYYY-MM
    SUM(Total) AS Revenue
FROM Invoice
GROUP BY Month
ORDER BY Month;

   sqlite:///chinook.db
 * sqlite:///chinook.sqlite
Done.

[('2009-01', 35.64),
 ('2009-02', 37.62),
 ('2009-03', 37.62),
 ('2009-04', 37.62),
 ('2009-05', 37.62),
 ('2009-06', 37.62),
 ('2009-07', 37.62),
 ('2009-08', 37.62),
 ('2009-09', 37.62),
 ('2009-10', 37.62),
 ('2009-11', 37.62),
 ('2009-12', 37.62),
 ('2010-01', 52.62),
 ('2010-02', 46.62),
 ('2010-03', 44.62),
 ('2010-04', 37.62),
 ('2010-05', 37.62),
 ('2010-06', 37.62),
 ('2010-07', 37.62),
 ('2010-08', 37.62),
 ('2010-09', 36.63),
 ('2010-10', 37.62),
 ('2010-11', 37.62),
 ('2010-12', 37.62),
 ('2011-01', 37.62),
 ('2011-02', 37.62),
 ('2011-03', 37.62),
 ('2011-04', 51.62),
 ('2011-05', 42.62),
 ('2011-06', 50.62),
 ('2011-07', 37.62),
 ('2011-08', 37.62),
 ('2011-09', 37.62),
 ('2011-10', 37.62),
 ('2011-11', 23.76),
 ('2011-12', 37.62),
 ('2012-01', 37.62),
 ('2012-02', 37.62),
 ('2012-03', 37.62),
 ('2012-04', 37.62),
 ('2012-05', 37.62),
 ('2012-06', 37.62),
 ('2012-07', 39.62),
 ('2012-08', 47.62),
 ('2012-09', 46.71),
 ('2012-10', 42.62),
 ('2012-11', 37.62),
 ('2012-12', 37.62),
 ('2013-01', 37.62),
 ('2013-02', 27.72),
 ('2013-03', 37.62),
 ('2013-04', 33.66),
 ('2013-05', 37.62),
 ('2013-06', 37.62),
 ('2013-07', 37.62),
 ('2013-08', 37.62),
 ('2013-09', 37.62),
 ('2013-10', 37.62),
 ('2013-11', 49.62),
 ('2013-12', 38.62)]

##  Exercise 4 — Calculate Year-to-Year Revenue

Write a query that calculates the **year-to-year revenue** at Chinook.

In [12]:
%%sql

SELECT 
    substr(InvoiceDate, 1, 4) AS Year,   -- Extracts YYYY
    SUM(Total) AS Revenue
FROM Invoice
GROUP BY Year
ORDER BY Year;

   sqlite:///chinook.db
 * sqlite:///chinook.sqlite
Done.

[('2009', 449.46),
 ('2010', 481.45),
 ('2011', 469.58),
 ('2012', 477.53),
 ('2013', 450.58)]

##  Exercise 5 — Filter Employees by Hire Date

Write a query that returns employees who were hired **after `2002-08-14`** and **before `2003-10-17`**.

In [13]:
%%sql


SELECT *
FROM Employee
WHERE HireDate > '2002-08-14'
  AND HireDate < '2003-10-17';

   sqlite:///chinook.db
 * sqlite:///chinook.sqlite
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com')]